changed the Architecture
